/*-------------------------------------------
Завдання № 2.
Написати ієрархію класів та продемонструвати
порядок ініціалізації полів класу.
Використати конструктор та статичні блоки
ініціалізації в усіх класах (мінімум 3 класи).
--------------------------------------------*/

package Lab2.Lab2_2;

public class Class1 {
    public static void main(String[] args) {
        Class2 two = new Class2();//Створення об'єктів
        Class3 three = new Class3();
        Class4 four = new Class4();
    }
}
