/*-------------------------------------------------------
Завдання № 2.
Створити unchecked exception, одним із полів
якого повинен бути enum із значеннями кодів
(200, 400, 500 - стандартні HTTP коди).
Створити клас Address та клас User
(клас Address є полем класу User, клас
User повинен мати щонайменше 5 полів).
Створити метод validate(...), який буде
перевіряти усі поля класу User на коректність заповнення.
-------------------------------------------------------*/


package Lab3.Lab3_2;

public class Login {
    public static void main(String[] args) throws ValidateException {

        //Створення адреси
        Address office = new Address("Європа", "Україна", "Львів", "Шевченка", 358, 106, 79039);

        //Створення юзера
        User igor = new User("Чучман", "Ігор", "Вікторович", 17, office);

        //Вивід інформації про юзера
        igor.out();

        //Метод котрий перевіряє правільність заповнення
        ValidateException.loginCheck(igor);
    }
}
